In [1]:
import numpy as np  
import pandas as pd

In [6]:
data = {
    'Date': pd.date_range(start='2025-01-01', periods=20, freq='D'),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West'],
    'Sales': np.random.randint(100, 500, size=20),
    'Units': np.random.randint(1, 20, size=20),
    'Rep': ['John', 'Jane', 'Doe', 'Smith', 'John', 'Jane', 'Doe', 'Smith', 'John', 'Jane', 'Doe', 'Smith', 'John', 'Jane', 'Doe', 'Smith', 'John', 'Jane', 'Doe', 'Smith'] 
}

df = pd.DataFrame(data)
df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = df['Date'].dt.quarter.astype(str).replace({'1': 'Q1', '2': 'Q2', '3': 'Q3', '4': 'Q4'})

df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2025-01-01       A  North    303     10   John  January      Q1
1  2025-01-02       B  South    165      3   Jane  January      Q1
2  2025-01-03       C   East    457     11    Doe  January      Q1
3  2025-01-04       D   West    375     18  Smith  January      Q1
4  2025-01-05       A  North    411     17   John  January      Q1
5  2025-01-06       B  South    254     11   Jane  January      Q1
6  2025-01-07       C   East    172     19    Doe  January      Q1
7  2025-01-08       D   West    423     15  Smith  January      Q1
8  2025-01-09       A  North    225     12   John  January      Q1
9  2025-01-10       B  South    186      4   Jane  January      Q1
10 2025-01-11       C   East    159      7    Doe  January      Q1
11 2025-01-12       D   West    367     11  Smith  January      Q1
12 2025-01-13       A  North    437      9   John  January      Q1
13 2025-01-14       B  South    170      2   Jane  January      Q1
14 2025-01-15       C   East    462     10    Doe  January      Q1
15 2025-01-16       D   West    498     19  Smith  January      Q1
16 2025-01-17       A  North    178      6   John  January      Q1
17 2025-01-18       B  South    355     15   Jane  January      Q1
18 2025-01-19       C   East    454      2    Doe  January      Q1
19 2025-01-20       D   West    464      1  Smith  January      Q1

In [ ]:
pd.pivot_table(df, values='Sales', index='Product', columns='Region')  # Pivot table with Product as index and Region as columns, showing total Sales (default aggregation is mean)

Region    East  North  South   West
Product
A          NaN  310.8    NaN    NaN
B          NaN    NaN  226.0    NaN
C        340.8    NaN    NaN    NaN
D          NaN    NaN    NaN  425.4

In [9]:
pd.pivot_table(df, index='Product', columns='Region', values='Sales', aggfunc='sum', fill_value=0)

Region   East  North  South  West
Product
A           0   1554      0     0
B           0      0   1130     0
C        1704      0      0     0
D           0      0      0  2127

In [11]:
pivot2 = pd.pivot_table(df, index='Product', columns='Region', values='Sales', aggfunc='sum', fill_value=0, margins=True, margins_name='Total')
pivot2

Region   East  North  South  West  Total
Product
A           0   1554      0     0   1554
B           0      0   1130     0   1130
C        1704      0      0     0   1704
D           0      0      0  2127   2127
Total    1704   1554   1130  2127   6515

In [12]:
pivot3 = pd.pivot_table(df, index='Region', columns='Product', values=['Sales', 'Units'], aggfunc='sum', fill_value=0, margins=True, margins_name='Total', dropna=False)

pivot3

        Sales                         Units
Product     A     B     C     D Total     A   B   C   D Total
Region
East        0     0  1704     0  1704     0   0  49   0    49
North    1554     0     0     0  1554    54   0   0   0    54
South       0  1130     0     0  1130     0  35   0   0    35
West        0     0     0  2127  2127     0   0   0  64    64
Total    1554  1130  1704  2127  6515    54  35  49  64   202

### CrossTab
----

In [ ]:
pd.crosstab(df['Region'], df['Product']) # Cross-tabulation of Region and Product, showing counts of occurrences

Product  A  B  C  D
Region
East     0  0  5  0
North    5  0  0  0
South    0  5  0  0
West     0  0  0  5